src/app/controllers/articles_controller.rb

  def index
    # @articles = Article.page(params[:page])
    # @users = User.where(id: @articles.pluck(:user_id))
    @articles = params[:tag_id].present? ? Tag.find(params[:tag_id]).articles : Article.all
    @articles = @articles.userName.page(params[:page]).order(id: "DESC")
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def show
    @article = Article.find(params[:id])
    @user = User.find_by(id: @article.user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1